{"id":1395303114093,"title":"Ring in the New Year with Shurooq\u0027s Colorful Lights: A Spectacular Family-Friendly Experience!","parts":["[[Ring in the New Year with Shurooq\u0027s Colorful Lights: A Spectacular Family-Friendly Experience]]. Ringing in the New Year with a bang, Shurooq’s destinations are set to light up the skies of Sharjah with vibrant colours and unforgettable experiences.","As the clock strikes midnight on 31st December, Shurooq’s family-friendly destinations will be ringing in the New Year with colourful lights and an array of exclusive events.","From breathtaking 8-minute fireworks displays at Al Majaz Waterfront to special flyboard shows and musical performances, visitors can enjoy a variety of activities that cater to everyone.","The tranquil atmosphere of Al Noor Island will be offering a special New Year’s Eve dining experience from 9:00 p.m.","until midnight, while Khorfakkan beach will be celebrating with a countdown, filling the sky with mesmerizing colours along with enchanting entertainment from LED, fire to bubble shows starting from 7:45 P.M. onwards for kids and families.","For those looking for an unforgettable desert camping experience, Mleiha Archaeological centre is offering overnight camping filled with dance, music, stargazing and traditional hospitality.","The experience will begin at 6:30 pm on 31st December with a free self-guided museum tour and will end by 8:00 am on the following morning with breakfast.","Other popular family destinations including Al Qasba, Al Montazah Parks, The Flag Island, Rahmaniya Parks and Heart of Sharjah also offer a wide range of unique world-class experiences at incredible value for residents and visitors.","Shurooq’s distinctive hospitality offerings under the ‘Sharjah Collection’ brand are also offering the perfect getaway for the New Year; from Mysk by Shaza Mysk Kingfisher Retreat in Kalba to Mysk Al Badayer Retreat in the heart of the Badayer desert; Mysk Al Faya Retreat overlooking the dunes of Mleiha to Mysk Moon retreat in the Mleiha region; as well as The Chedi Al Bait Sharjah – a true Arabian hospitality in the Heart of Sharjah managed by GHM – all providing guests with an unforgettable experience this New Year\u0027s Eve!."],"bulletPoints":["Shurooq’s family-friendly destinations in coordination with the Sharjah Commerce and Tourism Development Authority are set to ring the New Year with colorful lights.","Al Majaz Waterfront will have breathtaking 8-minute fabulous fireworks lighting up the Khalid Lagoon’s skyscapes, counting down to the new year.","Al Noor Island will offer a special New Year’s Eve dining experience from 9:00 p.m. until midnight, with a complimentary sky watch session if weather permits.","Khorfakkan beach will celebrate New Year’s Eve with a countdown, filling the sky with mesmerizing colours, along with enchanting entertainment from LED, fire to bubble shows starting from 7:45 P.M. onwards for kids and families.","Mleiha Archaeological centre is offering unforgettable overnight camping to visitors, filled with dance, music, stargazing, and traditional hospitality.","Other popular family destinations including Al Qasba, Al Montazah Parks, The Flag Island, Rahmaniya Parks, and Heart of Sharjah also offer a wide range of unique world-class experiences at incredible value for residents and visitors.","Shurooq’s distinctive hospitality offerings under the ‘Sharjah Collection’ brand are also offering the perfect getaway for the New Year."],"tweetId":"1606987374940110853","imageExist":true}