{"id":1395303114062,"title":"UAE and Morocco Strengthen Cooperation in Combating Terrorism and Arms Proliferation","parts":["[[UAE and Morocco Strengthen Cooperation in Combating Terrorism and Arms Proliferation]]. The meeting concluded with the two sides agreeing to continue their cooperation and exchange of experiences in this field.","The UAE delegation also visited the Moroccan Ministry of Justice, where they discussed ways to strengthen cooperation between the two countries in the field of combating terrorism and arms proliferation.","The UAE delegation also met with representatives from the Moroccan Ministry of Foreign Affairs and International Cooperation, where they discussed furthering bilateral relations between the two countries.","This visit is part of a series of visits that aim to strengthen cooperation between the UAE and Morocco in various fields, including combating terrorism and arms proliferation."],"bulletPoints":["Al Mannai expressed his appreciation for the efforts of the Moroccan side in this field, stressing the importance of exchanging experiences and expertise in order to strengthen cooperation between the two countries He also praised the efforts of Morocco in combating terrorism and arms proliferation, as well as its commitment to implementing United Nations Security Council resolutions.","UAE and Morocco exchanged experience in combating terrorism and arms proliferation.","The Executive Office for Control and Non-Proliferation (EOCN) from UAE met with members of the National Committee in charge of implementing United Nations Security Council resolutions in Morocco.","They discussed mechanisms and procedures to ensure optimal implementation of obligations from financial sector and designated non-financial professions.","They discussed prospects for partnership and capacity building, as well as ways to enhance cooperation.","Al Mannai expressed appreciation for Moroccan efforts in this field, praising their commitment to implementing UNSC resolutions."],"tweetId":"1607014469804113920","imageExist":true}