{"id":1395303113657,"title":"Industry 4.0: 100 Industrial Leaders Graduate from MoIAT-MBZUAI Leadership 4.0 Training Programme","parts":["The Ministry of Industry and Advanced Technology (MoIAT) and the Mohamed Bin Zayed University of Artificial Intelligence (MBZUAI) have collaborated to implement a Leadership 4.0 professional training programme for 100 C-suite leaders from the UAE’s industrial sector.","The programme is designed to develop knowledge and skills in the implementation of artificial intelligence (AI) in industry, with the aim of enhancing the nation’s industrial capacity through Fourth Industrial Revolution (4IR) technologies.","The programme has been successful in encouraging collaboration between industry leaders, resulting in business opportunities and supporting each other’s development.","MoIAT is committed to promoting the adoption of 4IR solutions by supporting companies in overcoming barriers to implementation."],"bulletPoints":["100 industrial leaders graduated from the joint MoIAT-MBZUAI Leadership 4.0 training programme.","The programme is designed to develop knowledge and skills in the implementation of artificial intelligence (AI) in industry.","The programme aims to enhance the nation’s industrial capacity through Fourth Industrial Revolution (4IR) technologies in line with Make it in the Emirates initiative.","The graduates included representatives from leading national and global companies such as Emirates Steel Arkan, Agthia Group, Ittihad Paper Mill, Gulf Coca-Cola Bottling, National Cement Factory LLC, Masafi, and Globalpharma LLC.","Keynote speakers included Saqr Bin Ghalib, Director of the UAE Artificial Intelligence Office, Pratulkumar Shinde, Associate Vice President, Siemens Advanta Consulting, and Mohittin Kourtev, Director Learning and Innovation, Strategic Programs at Edge Group.","Faculty members from MBZUAI led interactive sessions.","Initiatives such as the Champions 4.0 Network involve industry-leading knowledge partners helping industrial companies and SMEs to adopt 4IR solutions.","The Fourth Industrial Revolution Readiness Index is a key pillar of Industry 4.0 and supports businesses in their digital transformation journeys."],"tweetId":"1606267915581493251","imageExist":false}