{"id":1395303114080,"title":"RTA Opens Phase I of Sheikh Rashid bin Saeed Corridor Project: Enhancing Capacity and Reducing Travel Time in Dubai","parts":["[[RTA Opens Phase I of Sheikh Rashid bin Saeed Corridor Project: Enhancing Capacity and Reducing Travel Time in Dubai]].","Today marks a historic milestone for Dubai as the Roads and Transport Authority (RTA) opened Phase I of the Sheikh Rashid bin Saeed Improvement Corridor Project.","The project, which was initiated in response to the directives of His Highness Sheikh Mohammed bin Rashid Al Maktoum, Vice President, Prime Minister and Ruler of Dubai, is part of an ongoing effort to enhance the capacity of the city’s infrastructure and support its strategic objectives.\n\nThe project includes widening Ras Al Khor Road from three to four lanes in each direction over a 4km sector, and opening all bridges leading to Dubai Creek Harbour extending 1730m, with a capacity of about 10,600 vehicles per hour.","Upon completion of Phase I and II, the capacity of Ras Al Khor Road will jump to 10,000 vehicles per hour and travel time will drop from 20 minutes to about 7 minutes.\n\nThe project serves a host of major development projects inhabited by 650k persons namely The Lagoons, Dubai Creek, Meydan Horizon, Ras Al Khor, Al Wasl, and Nad Al Hamar Complex.","In addition to widening Ras Al Khor Road from three to four lanes in each direction over a 4km sector and opening all bridges leading to Dubai Creek Harbour extending 1730m with a capacity of about 10,600 vehicles per hour; Phase I also includes construction of two main bridges - one consisting of three lanes that extend 740m and serves the traffic inbound from Dubai-Al Ain Road and Al Khail Road heading east to Dubai Creek with an inward capacity of 7500 vehicles per hour; while the second is a 2-lane bridge with slopes extending 990m with a capacity of 3100 vehicles per hour serving traffic coming from Dubai Creek Harbour heading towards Ras Al Khor Road.","Phase II includes improving the intersection between Nad Al Hamar Road and Ras Al Khor Road such that its capacity increases up to 30 000 vehicles per hour through constructing a 2-lane bridge extending 988m providing free left turn for traffic inbound from Nad Al Hamar Road heading towards Sheikh Mohamed bin Zayed Road; along with another two-lane bridge extending 115m serving traffic incoming from Nad Al Hamar Road towards Ras Al Khor Road in the direction of Dubai-Al Ain road; as well as a two-lane underpass extending 368m providing right turn for traffic coming from Ras Al Khor road heading towards Nad al Hamar.","The Sheikh Rashid bin Saeed Improvement Corridor Project is set to revolutionize transportation across Dubai by enhancing traffic safety and flow while eliminating existing overlapping traffic spots.","This ambitious project is expected to have far reaching implications on economic growth across the emirate by providing improved access for commuters between various parts of the city."],"bulletPoints":["RTA begins Phase I of Sheikh Rashid bin Saeed Corridor Project.","Works included widening the road from three to four lanes in each direction over a 4km sector, and opening all bridges leading to Dubai Creek Harbour extending 1730m, with a capacity of about 10,600 vehicles per hour.","Upon the completion of the two phases, the capacity of Ras Al Khor Road will jump to 10,000 vehicles per hour, and the travel time will drop from 20 minutes to about 7 minutes.","Phase I includes widening Ras Al Khor Road from three to four lanes in each direction, and constructing a 2-lane service road along Ras Al Khor Road stretching 4.2 km.","Phase II includes improving the intersection of Nad Al Hamar Road and Ras Al Khor Road such that the capacity of the intersection will increase to 30,000 vehicles per hour through constructing a 2-lane bridge extending 988m."],"tweetId":"1606990642953031681","imageExist":true}