{"id":1395303114024,"title":"Ajman Motor Festival 2022: A Spectacular Showcase of Motors and Entertainment for All Ages","parts":["The Ajman Department of Tourism Development concluded the first edition of the Ajman Motor Festival 2022, which was held under the patronage of Sheikh Abdulaziz bin Humaid Al Nuaimi.","The festival offered many shows and interactive activities related to super cars, modified cars and motorcycles, in addition to multiple entertainment activities for families.","It also showcased a rare collection of classic cars that were manufactured last century and attracted thousands of visitors and car enthusiasts.","The festival included 4 main events that were held in different locations in Ajman, with vehicles including governmental cars, modified cars, super cars and motorcycles, drift cars, and more.","Additionally, more than 100 international teams participated in the 1000 Miglia Experience event which consisted of a 1600 km ride across the seven emirates.","The festival aimed to introduce the world of motors with its many car and motorcycle models to all its visitors while raising awareness on safe driving."],"bulletPoints":["The Ajman Department of Tourism Development concluded the first edition of the Ajman Motor Festival 2022, which was held under the patronage of Sheikh Abdulaziz bin Humaid Al Nuaimi, Chairman of the Ajman Tourism Development Department (ATDD).","The festival offered many shows and interactive activities related to super cars, modified cars and motorcycles, in addition to multiple entertainment activities for families.","The festival included 4 main events that were held in different locations in Ajman, which included City Centre Ajman, Ajman Museum, and Marsa Ajman that hosted activities coinciding with UAE’s 51st National Day.","More than 100 international teams coming from distant countries such as the UK, the USA, Germany, Italy, India, Switzerland, and Lebanon participated in the 1000 Miglia Experience event.","The event was organised in collaboration with the Automobile \u0026 Touring Club of the UAE (ATCUAE), the Ajman Police, the Ajman Civil Defense, City Centre Ajman, Marsa Ajman, Gulfa Water as the Hydration Sponsor, Saudi German Hospital and Ajman Volunteer Team."],"tweetId":"1606388511975870469","imageExist":false}