{"id":1395303114048,"title":"Launching a Greener Future: UAE Council for Environmental and Municipal Work Unveils \u0027Waste-free Schools\u0027 Project","parts":["The UAE Council for Environmental and Municipal Work held its second meeting, chaired by Mariam bint Mohammed Almheiri, Minister of Climate Change and the Environment.","The meeting saw the roll-out of the Waste-free Schools project that aims to promote the adoption of circular economy principles in schools.","The meeting also discussed environmental indicators of the “We The UAE 2031” vision and national plan, the preparedness of municipal authorities for the rainy season, and other topics.","MOCCAE signed a Memorandum of Understanding (MoU) with Emirates Schools Establishment, Abu Dhabi Waste Management Company (Tadweer), and Bee’ah Group to launch and implement Waste-free Schools project across 63 selected schools nationwide.","The Council also discussed a proposal to introduce a Net-Zero Government Pact 2050 in the UAE with the aim of enhancing the contribution of government entities to the national climate neutrality drive.","MOCCAE signed MoUs with 10 government entities to align their programs and initiatives with the UAE General Environmental Policy."],"bulletPoints":["UAE Council for Environmental and Municipal Work launches \u0027Waste-free Schools\u0027 project.","Project aims to promote the adoption of circular economy principles in schools.","Meeting agenda featured discussions of several key topics, including the environmental indicators of the “We The UAE 2031” vision and national plan.","MOCCAE signed a Memorandum of Understanding (MoU) with Emirates Schools Establishment, Abu Dhabi Waste Management Company (Tadweer), and Bee’ah Group to launch and implement Waste-free Schools project across 63 selected schools nationwide.","Council approved the establishment of five work teams: Studies and Research, Education and Awareness, Regional and International Participation, Policies and Legislations, and Transformational Projects.","MOCCAE presented an overview of phases one, two, and three of its Unified Municipal Work Guide that were previously launched.","Discussed a proposal to introduce a Net-Zero Government Pact 2050 in the UAE with the aim of enhancing the contribution of government entities to the national climate neutrality drive.","MOCCAE signed MoUs with 10 government entities to align their programs and initiatives with the UAE General Environmental Policy."],"tweetId":"1606930074388910081","imageExist":true}