{"id":1395303114098,"title":"MOCCAE Hosts First Meeting of Farmers\u0027 Council: Strengthening the Agricultural Sector for Food Security","parts":["[[MOCCAE Hosts First Meeting of Farmers\u0027 Council: Strengthening the Agricultural Sector for Food Security]].","The UAE is taking a major step towards achieving food security and sustainability with the first meeting of the Farmers’ Council, organised by the Ministry of Climate Change and Environment (MOCCAE).","The meeting was presided over by Mariam bint Mohammed Almheiri, Minister of Climate Change and the Environment, and highlighted the government’s directions to promote modern farming systems across the UAE.","The Minister noted that food security is a strategic priority for the country, and that establishing the Farmers’ Council will ensure that farmers’ voices are heard.","She applauded local farmers for their efforts in developing the sector through their compliance with related laws and regulations, as well as their shift to modern agriculture.","The meeting agenda featured an overview of the Council’s mandates, which include promoting advanced cultivation practices, developing an annual agricultural plan, identifying applicable agricultural systems, authorising applied agricultural research programmes to be executed at selected farms, organising capacity-building activities for farmers, and approving annual agricultural production programs and produce marketing plans.","Members also discussed a pledge signed by government entities at the UAE Annual Government Meeting on November 22nd 2023 to secure 50 percent of their food-related purchases from local farms by 2023.","Moreover, they explored finance solutions offered by Emirates Development Bank to modern agricultural SMEs and start-ups.","Hamid Obaid Al Zaabi, Council member representing Ajman farmers emphasised the importance of engaging farmers in government decisions and future plans for the sector.","Hamid Al Hamad from Abu Dhabi added that through enhancing capabilities of farmers they strive to realise His Highness Sheikh Mohamed bin Zayed Al Nahyan\u0027s vision of transforming the country into a global pioneer in agriculture.","The Farmers’ Council is an important step towards achieving food security in UAE while protecting its environment from climate change impacts.","It will ensure that farmers are given a platform to voice their concerns while helping them adopt modern farming practices for sustainable development."],"bulletPoints":["Ministry of Climate Change and Environment (MOCCAE) hosted the first meeting of the Farmers’ Council.","Meeting highlighted government directions to promote sustainable modern farming systems across the UAE.","Minister Mariam bint Mohammed Almheiri emphasised food security as a strategic priority of the UAE.","Council’s mandates include promoting adoption of state-of-the-art cultivation practices, developing an annual agricultural plan, and identifying applicable agricultural systems.","Emirates Development Bank offers finance solutions to modern agricultural SMEs and start-ups.","Council comprises two farmers’ representatives from each region in the UAE."],"tweetId":"1607007492462059520","imageExist":true}