{"id":1395303113687,"title":"Celebrating 50 Years of Japan-UAE Ties: Increased Official Interactions and a New Era of Cultural Relations","parts":["The 50th anniversary of Japan-UAE diplomatic relations has been marked by increased official and cultural interactions. Emiratis have shown a growing interest in various elements of Japanese culture, such as manga, anime, sushi, tea ceremony, flower arrangement and martial arts.","The number of food outlets offering Japanese foods in the UAE has increased by 163.4% in the past decade.","Japan is assisting Emirati undergraduates to study degree courses in Japan and engaging Japanese experts and artists in the UAE’s National Strategy for the Cultural and Creative Industries. Emiratis no longer need a visa to visit Japan.","High-level visits throughout the year culminated with H.H. Sheikh Khaled bin Mohamed bin Zayed Al Nahyan\u0027s visit to Tokyo in September, during which a Joint Declaration on the Implementation of Comprehensive Strategic Partnership Initiative was signed.","Japan-UAE joint decarbonisation projects will contribute to both countries’ climate agenda, while the UAE is ensuring stable supply of oil and gas to the global market.","Bilateral trade figures show steady progress with exports from the UAE to Japan at US$27 billion and imports from Japan to the UAE US$7 billion.","The success of Expo 2020 Dubai symbolised the UAE’s determination and efforts to connect the world together during a difficult time, with Osaka-Kansai Expo 2025 following suit."],"bulletPoints":["Increased official and cultural interactions have enriched the 50th anniversary celebrations of Japan-UAE diplomatic relations.","Emiratis’ increasing interest in various elements of Japanese culture has opened up a new era in cultural relations.","Widening Emirati interest in Japan, including manga, anime, sushi, tea ceremony, flower arrangement, and martial arts such as Judo.","Youth Ambassadors Programme (YAP) to assist Emirati undergraduates to study degree courses in Japan.","Engagement of Japanese experts and artists in the UAE’s National Strategy for the Cultural and Creative Industries.","Starting from November 1, 2022, Emiratis no longer need a visa to visit Japan.","Joint Declaration on the Implementation of Comprehensive Strategic Partnership Initiative (CSPI) signed during H.H. Sheikh Khaled bin Mohamed bin Zayed Al Nahyan’s visit to Tokyo.","Japan-UAE joint decarbonisation projects to contribute to both countries’ climate agenda.","UAE as largest source of crude oil import for Japan; exports from the UAE to Japan US$27 billion; imports from Japan to the UAE US$7 billion.","Expo 2020 Dubai symbolised the UAE’s determination and efforts to connect the world together; Osaka-Kansai Expo 2025 will further strengthen bilateral cooperation."],"tweetId":"1606266918826086401","imageExist":true}