{"id":1395303113970,"title":"Celebrating 25 Years of Excellence: Hamdan bin Rashid Al Maktoum Foundation Unveils Results of its Local Awards","parts":["The Hamdan bin Rashid Al Maktoum Foundation for Distinguished Academic Performance has unveiled the results of its 25th cycle of local awards.","49 winners out of 177 candidates were approved for the awards, including Distinguished Student, Distinguished Undergraduate University Student, Distinguished Teacher, Distinguished Educator and Distinguished School.","The Board of Trustees praised the Ministry of Education and higher education institutions for their support and dedication to aiding its initiatives.","Over the course of 25 years, the Foundation has updated its evaluation criteria to create models of outstanding educational performance. Winners will be recognized at a ceremony in March 2023 in Dubai."],"bulletPoints":["Hamdan bin Rashid Al Maktoum Foundation for Distinguished Academic Performance unveils results of its local awards.","49 distinguished winners out of a total of 177 candidates who underwent final arbitration were approved for the awards.","Humaid Muhammad Al Qatami, Chairman of the Board of Trustees of the Foundation, praised the Ministry of Education, higher education institutions, and strategic partners for their support.","Dr. Khalifa Al Suwaidi, Secretary-General of the Foundation, said that the foundation is pleased with the response from the educational field as well as the participation in the awards and the outcomes of the evaluation.","Dr. Ali Al Kaabi, General Coordinator of the Juries’ Committees, clarified that the central arbitration of the award was carried out through interviews and virtual visits to ensure that the assessment process was conducted in accordance with international standards.","Winners of Hamdan bin Rashid Al Maktoum Foundation for Distinguished Academic Performance awards at the local, Gulf, pan Arab and international levels will be recognized at a ceremony in March 2023 in Dubai."],"tweetId":"1606245699858857984","imageExist":true}