{"id":1395303113698,"title":"Explore the Wonders of Al Heera Beach: Sharjah\u0027s Latest Beachfront Destination","parts":["Shurooq has opened their latest beachfront destination in Sharjah, Al Heera Beach. The 3.5km shoreline offers a range of services and facilities, including 18 commercial units with restaurants, cafes, a gym, art installations and a skatepark.","Three of the commercial units have opened today, with the remaining 12 to be opened before the end of the first quarter of 2023. The project is part of Shurooq\u0027s portfolio of tourism and leisure projects that aim to enrich residents and visitors to Sharjah with unique activities.","It includes public service facilities for beach goers, two jogging and bicycle tracks, Qudra Fitness Gym, recreational areas for children as well as Tim Hortons Café and Virginia Angus Steakhouse.","Additionally there are prayer rooms for both men and women as well as an open space for seasonal celebrations and parking for vehicles. A pro-skatepark will also be opening soon in partnership with four-time world scooter rider champion Dakota Schuetz.","Art installations in cooperation with Maraya Art Centre will also be featured at Al Heera Beach when it is completed in the first quarter of 2023."],"bulletPoints":["Shurooq has opened their latest beachfront destination in Sharjah, ‘Al Heera Beach’.","The project stretches over 3.5km of shoreline in the Al Fisht area, with a picturesque setting overlooking the Arabian Gulf.","The new development offers a plethora of services and facilities, as well as 18 commercial units that include renowned restaurants and cafes, a fully equipped gym, art installations in cooperation with Maraya Art Centre, a professional skatepark “KOTA” as well as public amenities.","Three of the commercial units have opened today, and include a restaurant, a café and fully equipped gym.","The remaining 12 units will be opened before the end of the first quarter of 2023.","The project provides an extensive range of opportunities for investors, SMEs and businesses looking to grow or diversify their commercial operations in the emirate.","In light of a partnership with four-time world scooter rider champion, Dakota Schuetz, Shurooq will soon be opening a pro-skatepark to provide a dedicated space for extreme sports activities in the emirate.","Al Heera Beach will also feature art installations in cooperation with Maraya Art Centre to make it a cultural attraction for all that visit."],"tweetId":"","imageExist":false}