{"id":1395303113687,"title":"Celebrating 50 Years of Japan-UAE Ties: Increased Official Interactions and a New Era of Cultural Relations","parts":["The 50th anniversary of Japan-UAE diplomatic relations has been marked by increased official and cultural interactions. Emiratis have shown a growing interest in various elements of Japanese culture, such as manga, anime, sushi, tea ceremony, flower arrangement and martial arts.","There has also been a 163.4% increase in the number of food outlets offering Japanese food in the UAE over the past decade. Japan is assisting Emirati undergraduates to study degree courses in Japan through the Youth Ambassadors Programme (YAP).","Additionally, Japan is engaging Japanese experts and artists in the UAE’s National Strategy for the Cultural and Creative Industries. Starting from November 1, 2022, Emiratis no longer need a visa to visit Japan.","High-level visits throughout this year have further strengthened the bilateral strategic partnership and joint decarbonisation projects will contribute to both countries’ climate agenda.","The UAE is also an important partner for energy security for Japan as it is currently the largest source of crude oil import for Japan.","The success of Expo 2020 Dubai has symbolised the UAE’s determination to connect the world together during a difficult time and Japan is determined to make Osaka-Kansai Expo 2025 a great success too."],"bulletPoints":["Increased official and cultural interactions have enriched the 50th anniversary celebrations of Japan-UAE diplomatic relations.","Emiratis’ increasing interest in various elements of Japanese culture has opened up a new era in cultural relations.","Widening Emirati interest in Japan, including manga, anime, sushi, tea ceremony, flower arrangement, and martial arts such as Judo.","Japan assisting Emirati undergraduates to study degree courses in Japan.","Engaging Japanese experts and artists in the UAE’s National Strategy for the Cultural and Creative Industries.","Number of food outlets offering Japanese foods in the UAE has made a quantum leap of 163.4 percent in the past decade.","Starting from November 1, 2022, Emiratis no longer need a visa to visit Japan.","Joint Declaration on the Implementation of Comprehensive Strategic Partnership Initiative (CSPI) signed during H.H. Sheikh Khaled bin Mohamed bin Zayed Al Nahyan’s visit to Tokyo.","Japan-UAE joint decarbonisation projects will contribute to both countries’ climate agenda.","The UAE was the largest source of crude oil import for Japan for September 2022, accounting for 45 percent.","Exports from the UAE to Japan were to the tune of US$27 billion; imports from Japan to the UAE US$7 billion.","Expo 2020 Dubai symbolised the UAE’s determination and efforts to connect the world together; Osaka-Kansai Expo 2025 will further strengthen bilateral cooperation."],"tweetId":"","imageExist":true}