{"id":1395303113687,"title":"Celebrating 50 Years of Japan-UAE Ties: A New Era of Cultural Relations and Growing Official Interactions","parts":["The 50th anniversary of Japan-UAE diplomatic relations has been marked by increased official and cultural interactions. Emiratis have shown a growing interest in various elements of Japanese culture, such as manga, anime, sushi, tea ceremony, flower arrangement and martial arts.","There has also been a 163.4% increase in the number of food outlets offering Japanese food in the UAE over the past decade. Japan is assisting Emirati undergraduates to study degree courses in Japan through the Youth Ambassadors Programme (YAP).","The two countries are also working together to engage Japanese experts and artists in the UAE’s National Strategy for the Cultural and Creative Industries. Emiratis no longer need a visa to visit Japan as of November 1, 2022.","High-level visits have further strengthened the bilateral strategic partnership, with a Joint Declaration on the Implementation of Comprehensive Strategic Partnership Initiative (CSPI) being signed during one such visit.","Japan and the UAE are also collaborating on joint decarbonisation projects to contribute to their climate agendas. The UAE is an important partner for Japan\u0027s energy security, with it being the largest source of crude oil import for Japan in September 2022.","Bilateral trade figures have also shown steady progress.."],"bulletPoints":["Increased official and cultural interactions have enriched the 50th anniversary celebrations of Japan-UAE diplomatic relations","Emiratis’ increasing interest in various elements of Japanese culture has opened up a new era in cultural relations","Widening Emirati interest in Japan, including manga, anime, sushi, tea ceremony, flower arrangement, and martial arts such as Judo","Youth Ambassadors Programme (YAP) to assist Emirati undergraduates to study degree courses in Japan","Engagement of Japanese experts and artists in the UAE’s National Strategy for the Cultural and Creative Industries","Starting from November 1, 2022, Emiratis no longer need a visa to visit Japan","Joint Declaration on the Implementation of Comprehensive Strategic Partnership Initiative (CSPI) signed during H.H. Sheikh Khaled bin Mohamed bin Zayed Al Nahyan’s visit to Tokyo","Japan-UAE joint decarbonisation projects to contribute to both countries’ climate agenda","UAE as largest source of crude oil import for Japan; exports from the UAE to Japan US$27 billion; imports from Japan to the UAE US$7 billion","Expo 2020 Dubai symbolised the UAE’s determination and efforts to connect the world together; Osaka-Kansai Expo 2025 will further strengthen bilateral cooperation"],"tweetId":"","imageExist":true}